// @ts-ignore
import { HistoryDate } from "@types/history";

export const historyDates: HistoryDate[] = [
  {
    title: 'Технологии',
    startYear: 1980,
    endYear: 1986,
    events: [
      {
        year: 1980,
        text: 'Sinclair Research выпускает домашний компьютер ZX80.',
      },
      {
        year: 1982,
        text: 'Появился домашний компьютер ZX Sinclair Research выпускает домашний компьютер ZX80.',
      },
    ],
  },
  {
    title: 'Кино',
    startYear: 1987,
    endYear: 1991,
    events: [
      {
        year: 1987,
        text: '«Хищник»/Predator, США (реж. Джон Мактирнан).',
      },
      {
        year: 1988,
        text: '«Кто подставил кролика Роджера»/Who Framed Roger Rabbit, США (реж. Роберт Земекис).',
      },
      {
        year: 1989,
        text: '«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земекис).',
      },
      {
        year: 1990,
        text: '«Крепкий орешек 2»/Die Hard 2, США (реж. Ренни Харлин).',
      },
      {
        year: 1991,
        text: '«Семейка Аддамс»/The Addams Family, США (реж. Барри Зонненвельд).',
      },
    ]
  },
  {
    title: 'Литература',
    startYear: 1992,
    endYear: 1997,
    events: [
      {
        year: 1992,
        text: 'Нобелевская премия по литературе - Дерек Уолкотт, «За блестящий образец карибского эпоса в 64 разделах».',
      },
      {
        year: 1994,
        text: '«Бессонница» - роман Стивена Кинга.',
      },
      {
        year: 1995,
        text: 'Нобелевская премия по литературе - Шеймас Хини.',
      },
      {
        year: 1997,
        text: '«Гарри Поттер и филосовский камень» - Джоан К. Роулинг.',
      },
    ],
  },
  {
    title: 'Искусство',
    startYear: 1999,
    endYear: 2004,
    events: [
      {
        year: 1999,
        text: 'Премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона.',
      },
      {
        year: 2000,
        text: 'Возобновлено издание журнала «Театр».',
      },
      {
        year: 2002,
        text: 'Премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон.',
      },
      {
        year: 2003,
        text: 'В Венеции Премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон.',
      },
    ],
  },
  {
    title: 'Спорт',
    startYear: 2006,
    endYear: 2014,
    events: [
      {
        year: 2006,
        text: 'Баскетбольный клуб ЦСКА стал победителем национального первенства России.',
      },
      {
        year: 2008,
        text: 'С 8 по 24 августа в Пекине прошли 29-е летние Олимпийские игры.',
      },
      {
        year: 2010,
        text: '13-28 февраля в Ванкувере: Зимние Олимпийские игры 2010 года.',
      },
      {
        year: 2012,
        text: '2 августа - Летние Олимпийские игры.',
      },
      {
        year: 2014,
        text: 'XXII зимние Олимпийские игры (Сочи, Россия).',
      },
    ],
  },
  {
    title: 'Наука',
    startYear: 2015,
    endYear: 2022,
    events: [
      {
        year: 2015,
        text: '13 сентября - частное солнечное затмение, видимое в Южной Африке и части Антарктиды.',
      },
      {
        year: 2016,
        text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую название GN-z11.',
      },
      {
        year: 2017,
        text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi.',
      },
      {
        year: 2018,
        text: 'Старт космического аппарата Solar Probe Plus, предназначенного для изучения Солнца.',
      },
      {
        year: 2019,
        text: 'Google объявил о создании 53-кубитного квантового компьютера.',
      },
      {
        year: 2020,
        text: 'Корабль Crew Dragon вернулся на Землю из первого пилотируемого полёта.',
      },
    ],
  },
]